export const tempBlogs = [
    {
      id: 1,
      authorId: 1,
      title: "The Importance of Sustainable Living",
      description:
        "Sustainable living is essential for the well-being of our planet and future generations.",
      content:
        "# The Importance of Sustainable Living\n\nAs human activities continue to exert immense pressure on the planet, sustainable living has emerged as a necessity rather than a choice. But what does it mean to live sustainably?\n\n## Understanding Sustainability\nSustainability involves meeting our needs without compromising the ability of future generations to meet theirs. This requires balancing economic, social, and environmental factors.\n\n## Why is it Important?\n1. **Climate Change Mitigation**: Carbon emissions from unsustainable practices are heating the planet. Reducing waste, using renewable energy, and consuming responsibly can help reverse the trend.\n2. **Preservation of Resources**: Finite natural resources like water and fossil fuels need to be used judiciously to avoid depletion.\n3. **Healthy Ecosystems**: Adopting eco-friendly habits helps protect biodiversity, which is crucial for ecosystem balance.\n\n## How to Start Living Sustainably?\n- **Reduce, Reuse, Recycle**: Minimize waste by recycling and opting for reusable items.\n- **Support Local and Ethical Products**: Reduce the carbon footprint by buying locally sourced goods.\n- **Conserve Energy**: Switch to energy-efficient appliances and turn off unused electronics.\n\nTogether, small changes in our daily habits can create a significant impact on the planet’s future.",
      tags: ["Sustainability", "Climate Change", "Eco-Friendly"],
      createdAt: "2024-12-01T10:00:00Z",
      modifiedAt: "2024-12-05T14:00:00Z",
      createdBy: "admin",
      modifiedBy: "admin",
      image:
        "https://images.pexels.com/photos/11622797/pexels-photo-11622797.jpeg?auto=compress&cs=tinysrgb&w=800",
    },
    {
      id: 2,
      authorId: 2,
      title: "How Trees Fight Climate Change",
      description:
        "Discover the powerful role of trees in combating global climate change.",
      content:
        '# How Trees Fight Climate Change\n\nThe fight against climate change often feels overwhelming, but nature has provided us with a simple, effective weapon: trees.\n\n## The Role of Trees in Climate Action\nTrees are often called the "lungs of the Earth," and for a good reason. Here\'s why:\n\n1. **Carbon Sequestration**: Trees absorb carbon dioxide (CO2) from the atmosphere during photosynthesis, storing it as biomass. On average, a mature tree can absorb approximately 22 kg of CO2 annually.\n2. **Cooling Effect**: Tree canopies reduce urban heat by providing shade and releasing water vapor. This mitigates the “heat island” effect found in cities.\n3. **Biodiversity Support**: Forests house 80% of terrestrial animals and plants, providing crucial habitats. Biodiversity is vital for resilient ecosystems.\n\n## Threats to Trees\nDespite their importance, deforestation continues unabated, driven by:\n- Agriculture\n- Logging\n- Urbanization\n\n## What Can We Do?\n- **Plant More Trees**: Engage in afforestation drives.\n- **Protect Forests**: Support policies that prevent illegal logging.\n- **Adopt Reforestation Practices**: Encourage replanting in degraded areas.\n\nPlanting and protecting trees is one of the easiest and most impactful ways to mitigate climate change. Let’s take action before it’s too late.',
      tags: ["Climate Change", "Trees", "Deforestation", "Reforestation"],
      createdAt: "2024-12-02T12:00:00Z",
      modifiedAt: "2024-12-06T10:00:00Z",
      createdBy: "editor",
      modifiedBy: "editor",
      image:
        "https://images.pexels.com/photos/1933386/pexels-photo-1933386.jpeg?auto=compress&cs=tinysrgb&w=800",
    },
    {
      id: 3,
      authorId: 3,
      title: "The Perils of Plastic Pollution",
      description:
        "Explore the devastating impact of plastic pollution on ecosystems and how to tackle it.",
      content:
        "# The Perils of Plastic Pollution\n\nPlastic has become an integral part of our lives, but its overuse comes with devastating consequences.\n\n## The Problem with Plastic\n1. **Non-Biodegradable**: Most plastics take hundreds of years to decompose, polluting the environment indefinitely.\n2. **Threat to Marine Life**: Over 8 million tons of plastic end up in the ocean every year, killing marine animals and disrupting ecosystems.\n3. **Microplastics**: Tiny fragments of plastic enter the food chain, posing health risks to humans and wildlife.\n\n## Alarming Statistics\n- By 2050, there will be more plastic in the ocean than fish by weight.\n- 1 million plastic bottles are purchased every minute worldwide.\n\n## Solutions to Plastic Pollution\n- **Switch to Alternatives**: Use biodegradable or reusable materials like glass and bamboo.\n- **Ban Single-Use Plastics**: Advocate for local bans on straws, bags, and other single-use items.\n- **Participate in Cleanups**: Engage in local beach and park cleanups to remove existing waste.\n\nTackling plastic pollution requires both individual actions and systemic changes. Let’s strive for a cleaner, greener planet.",
      tags: ["Plastic Pollution", "Marine Life", "Sustainable Practices"],
      createdAt: "2024-12-03T09:00:00Z",
      modifiedAt: "2024-12-07T16:00:00Z",
      createdBy: "writer",
      modifiedBy: "writer",
      image:
        "https://images.pexels.com/photos/5936277/pexels-photo-5936277.jpeg?auto=compress&cs=tinysrgb&w=800",
    },
    {
      id: 4,
      authorId: 4,
      title: "Renewable Energy: A Path to a Cleaner Future",
      description:
        "Explore the benefits of renewable energy sources and their potential to replace fossil fuels.",
      content:
        "# Renewable Energy: A Path to a Cleaner Future\n\nAs fossil fuels drive climate change and environmental degradation, renewable energy offers a sustainable solution. Here’s why renewable energy is key to our future.\n\n## Types of Renewable Energy\n1. **Solar Energy**: Harnessing the power of the sun through photovoltaic cells and solar panels.\n2. **Wind Energy**: Generating power by converting wind movement into electricity.\n3. **Hydropower**: Utilizing flowing water to generate energy.\n4. **Geothermal Energy**: Tapping into the Earth’s heat.\n\n## Benefits of Renewable Energy\n- **Reduces Greenhouse Gases**: Limits harmful emissions that contribute to global warming.\n- **Promotes Energy Independence**: Reduces reliance on imported fuels.\n- **Creates Jobs**: The renewable energy sector generates millions of jobs worldwide.\n\nBy investing in renewable energy, we can pave the way for a sustainable and equitable energy system.",
      tags: ["Renewable Energy", "Clean Energy", "Sustainability"],
      createdAt: "2024-12-04T14:00:00Z",
      modifiedAt: "2024-12-08T11:00:00Z",
      createdBy: "eco_user",
      modifiedBy: "eco_user",
      image:
        "https://images.pexels.com/photos/5936277/pexels-photo-5936277.jpeg?auto=compress&cs=tinysrgb&w=800",
    },
    {
      id: 5,
      authorId: 5,
      title: "Biodiversity: The Heart of a Thriving Planet",
      description:
        "Understanding the critical role biodiversity plays in maintaining ecosystems.",
      content:
        "# Biodiversity: The Heart of a Thriving Planet\n\nBiodiversity encompasses the variety of life on Earth, from microorganisms to megafauna. Here’s why it’s crucial to protect.\n\n## Why Biodiversity Matters\n1. **Ecosystem Services**: Biodiversity supports processes like pollination, nutrient cycling, and water purification.\n2. **Food Security**: Diverse species provide varied food sources, ensuring resilience against agricultural threats.\n3. **Cultural Value**: Many cultures deeply value biodiversity for spiritual and recreational purposes.\n\n## Current Threats\n- Habitat destruction\n- Pollution\n- Climate change\n\n## Steps to Protect Biodiversity\n- Create and support conservation programs.\n- Promote sustainable land and resource management.\n- Raise awareness about the value of biodiversity.",
      tags: ["Biodiversity", "Conservation", "Ecosystems"],
      createdAt: "2024-12-05T15:00:00Z",
      modifiedAt: "2024-12-09T18:00:00Z",
      createdBy: "biologist",
      modifiedBy: "biologist",
      image:
        "https://images.pexels.com/photos/5936277/pexels-photo-5936277.jpeg?auto=compress&cs=tinysrgb&w=800",
    },
  ];